GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F04Q20.inc
;----- CONFIG7 Options --------------------------------------------------
_VDDIO2MD_STANDARD_RANGE_7 EQU  H'FF'; Standard Operating Range (VDDIO2 >= 1.62V)
_VDDIO2MD_LOW_VOLTAGE_RANGE_7 EQU  H'FE'; Low-voltage Operating Range (VDDIO2 < 1.62V)

;----- CONFIG8 Options --------------------------------------------------
_BBSIZE_BBSIZE_4096_8 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_8 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_8 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_8 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_8 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_8 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_8 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_8 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_8 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_8 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_8 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_8 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_8 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_8 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_8 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_8 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_8 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_8 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_8 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_8 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_8 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_8 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_8 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_8 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_8 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_8 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_8 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_8 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_8 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_8 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_8 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_8 EQU  H'00'; Boot Block size is 128 words

;----- CONFIG10 Options --------------------------------------------------
_WRTB_OFF_10         EQU  H'FF'; Boot Block is not write-protected
_WRTB_ON_10          EQU  H'FE'; Boot Block is write-protected
_WRTC_OFF_10         EQU  H'FF'; Configuration registers are not write-protected
_WRTC_ON_10          EQU  H'FD'; Configuration registers are write-protected
_WRTD_OFF_10         EQU  H'FF'; Data EEPROM is not write-protected
_WRTD_ON_10          EQU  H'FB'; Data EEPROM is write-protected
_WRTSAF_OFF_10       EQU  H'FF'; SAF is not write-protected
_WRTSAF_ON_10        EQU  H'F7'; SAF is write-protected
_WRTAPP_OFF_10       EQU  H'FF'; Application Block is not write-protected
_WRTAPP_ON_10        EQU  H'7F'; Application Block is write-protected

;----- CONFIG11 Options --------------------------------------------------
_CP_OFF_11           EQU  H'FF'; User PFM code protection is disabled
_CP_ON_11            EQU  H'FE'; User PFM code protection is enabled

;----- CONFIG12 Options --------------------------------------------------
_CPD_OFF_12          EQU  H'FF'; Data EEPROM code protection is disabled
_CPD_ON_12           EQU  H'FE'; Data EEPROM code protection is enabled

;----- CONFIG14 Options --------------------------------------------------
_SAFLOCK_OFF_14      EQU  H'FF'; SAF Lock disabled
_SAFLOCK_ON_14       EQU  H'FE'; SAF Lock enabled, SAF areas are locked and SAFSZ bits cannot be erased

;----- CONFIG9 Options --------------------------------------------------
_SAFSZ_SAFSZ_NONE_9  EQU  H'FF'; NONE
_SAFSZ_SAFSZ_128_9   EQU  H'FE'; Last 128 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_256_9   EQU  H'FC'; Last 256 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_384_9   EQU  H'F8'; Last 384 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_512_9   EQU  H'F0'; Last 512 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_640_9   EQU  H'E0'; Last 640 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_768_9   EQU  H'C0'; Last 768 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_896_9   EQU  H'80'; Last 896 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits
_SAFSZ_SAFSZ_1024_9  EQU  H'00'; Last 1024 words of PFM; self write operation depends on WRTSAF and SAFLOCK bits

;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'200000'
_IDLOC1            EQU  H'200001'
_IDLOC2            EQU  H'200002'
_IDLOC3            EQU  H'200003'
_IDLOC4            EQU  H'200004'
_IDLOC5            EQU  H'200005'
_IDLOC6            EQU  H'200006'
_IDLOC7            EQU  H'200007'
_IDLOC8            EQU  H'200008'
_IDLOC9            EQU  H'200009'
_IDLOC10           EQU  H'20000A'
_IDLOC11           EQU  H'20000B'
_IDLOC12           EQU  H'20000C'
_IDLOC13           EQU  H'20000D'
_IDLOC14           EQU  H'20000E'
_IDLOC15           EQU  H'20000F'
_IDLOC16           EQU  H'200010'
_IDLOC17           EQU  H'200011'
_IDLOC18           EQU  H'200012'
_IDLOC19           EQU  H'200013'
_IDLOC20           EQU  H'200014'
_IDLOC21           EQU  H'200015'
_IDLOC22           EQU  H'200016'
_IDLOC23           EQU  H'200017'
_IDLOC24           EQU  H'200018'
_IDLOC25           EQU  H'200019'
_IDLOC26           EQU  H'20001A'
_IDLOC27           EQU  H'20001B'
_IDLOC28           EQU  H'20001C'
_IDLOC29           EQU  H'20001D'
_IDLOC30           EQU  H'20001E'
_IDLOC31           EQU  H'20001F'
_IDLOC32           EQU  H'200020'
_IDLOC33           EQU  H'200021'
_IDLOC34           EQU  H'200022'
_IDLOC35           EQU  H'200023'
_IDLOC36           EQU  H'200024'
_IDLOC37           EQU  H'200025'
_IDLOC38           EQU  H'200026'
_IDLOC39           EQU  H'200027'
_IDLOC40           EQU  H'200028'
_IDLOC41           EQU  H'200029'
_IDLOC42           EQU  H'20002A'
_IDLOC43           EQU  H'20002B'
_IDLOC44           EQU  H'20002C'
_IDLOC45           EQU  H'20002D'
_IDLOC46           EQU  H'20002E'
_IDLOC47           EQU  H'20002F'
_IDLOC48           EQU  H'200030'
_IDLOC49           EQU  H'200031'
_IDLOC50           EQU  H'200032'
_IDLOC51           EQU  H'200033'
_IDLOC52           EQU  H'200034'
_IDLOC53           EQU  H'200035'
_IDLOC54           EQU  H'200036'
_IDLOC55           EQU  H'200037'
_IDLOC56           EQU  H'200038'
_IDLOC57           EQU  H'200039'
_IDLOC58           EQU  H'20003A'
_IDLOC59           EQU  H'20003B'
_IDLOC60           EQU  H'20003C'
_IDLOC61           EQU  H'20003D'
_IDLOC62           EQU  H'20003E'
_IDLOC63           EQU  H'20003F'

        LIST
